nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mk0512gpe100.h
typedef enum {

    ADCHS_CLOCK_SOURCE_PBCLK = 0,
    ADCHS_CLOCK_SOURCE_FRC = 1,
    ADCHS_CLOCK_SOURCE_RFCLK3 = 2,
    ADCHS_CLOCK_SOURCE_SYSCLK = 3

} ADCHS_CLOCK_SOURCE;

typedef enum {

    ADCHS_VREF_AVDD_AVSS = 0,
    ADCHS_VREF_EXTVREFP_AVSS = 1,
    ADCHS_VREF_AVDD_EXTVREFN = 2,
    ADCHS_VREF_EXTVREFP_EXTVREFN = 3

} ADCHS_VREF_SOURCE;

typedef enum {

    ADCHS_CHANNEL_0 = 0,
    ADCHS_CHANNEL_1 = 1,
    ADCHS_CHANNEL_2 = 2,
    ADCHS_CHANNEL_3 = 3,
    ADCHS_CHANNEL_4 = 4,
    ADCHS_CHANNEL_5 = 5,
    ADCHS_CHANNEL_7 = 7

} ADCHS_CHANNEL_ID;

typedef enum {

    ADCHS_CHANNEL_0_DEFAULT_INP_AN0 = 0,
    ADCHS_CHANNEL_0_ALTERNATE_INP_AN3 = 1,
    ADCHS_CHANNEL_0_ALTERNATE_INP_AN5 = 2,
    ADCHS_CHANNEL_0_ALTERNATE_INP_AN24 = 3,
    ADCHS_CHANNEL_1_DEFAULT_INP_AN1 = 4,
    ADCHS_CHANNEL_1_ALTERNATE_INP_AN4 = 5,
    ADCHS_CHANNEL_1_ALTERNATE_INP_AN7 = 6,
    ADCHS_CHANNEL_1_ALTERNATE_INP_AN0 = 7,
    ADCHS_CHANNEL_2_DEFAULT_INP_AN2 = 8,
    ADCHS_CHANNEL_2_ALTERNATE_INP_AN5 = 9,
    ADCHS_CHANNEL_2_ALTERNATE_INP_AN6 = 10,
    ADCHS_CHANNEL_2_ALTERNATE_INP_AN25 = 11,
    ADCHS_CHANNEL_3_DEFAULT_INP_AN3 = 12,
    ADCHS_CHANNEL_3_ALTERNATE_INP_AN0 = 13,
    ADCHS_CHANNEL_3_ALTERNATE_INP_AN8 = 14,
    ADCHS_CHANNEL_3_ALTERNATE_INP_AN26 = 15,
    ADCHS_CHANNEL_4_DEFAULT_INP_AN4 = 16,
    ADCHS_CHANNEL_4_ALTERNATE_INP_AN1 = 17,
    ADCHS_CHANNEL_4_ALTERNATE_INP_AN9 = 18,
    ADCHS_CHANNEL_4_ALTERNATE_INP_AN0 = 19,
    ADCHS_CHANNEL_5_DEFAULT_INP_AN5 = 20,
    ADCHS_CHANNEL_5_ALTERNATE_INP_AN2 = 21,
    ADCHS_CHANNEL_5_ALTERNATE_INP_AN6 = 22,
    ADCHS_CHANNEL_5_ALTERNATE_INP_AN25 = 23

} ADCHS_CHANNEL_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN0 = 0,
    ADCHS_ALTERNATE_1_CLASS1_AN3 = 1,
    ADCHS_ALTERNATE_2_CLASS1_AN5 = 2,
    ADCHS_ALTERNATE_3_CLASS1_AN24 = 3

} ADCHS_CHANNEL_0_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN1 = 4,
    ADCHS_ALTERNATE_1_CLASS1_AN4 = 5,
    ADCHS_ALTERNATE_2_CLASS1_AN7 = 6,
    ADCHS_ALTERNATE_3_CLASS1_AN0 = 7

} ADCHS_CHANNEL_1_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN2 = 8,
    ADCHS_ALTERNATE_1_CLASS1_AN5 = 9,
    ADCHS_ALTERNATE_2_CLASS1_AN6 = 10,
    ADCHS_ALTERNATE_3_CLASS1_AN25 = 11

} ADCHS_CHANNEL_2_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN3 = 12,
    ADCHS_ALTERNATE_1_CLASS1_AN0 = 13,
    ADCHS_ALTERNATE_2_CLASS1_AN8 = 14,
    ADCHS_ALTERNATE_3_CLASS1_AN26 = 15

} ADCHS_CHANNEL_3_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN4 = 16,
    ADCHS_ALTERNATE_1_CLASS1_AN1 = 17,
    ADCHS_ALTERNATE_2_CLASS2_AN9 = 18,
    ADCHS_ALTERNATE_3_CLASS1_AN0a = 19

} ADCHS_CHANNEL_4_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN5 = 20,
    ADCHS_ALTERNATE_1_CLASS1_AN2 = 21,
    ADCHS_ALTERNATE_2_CLASS3_AN25 = 22,
    ADCHS_ALTERNATE_3_CLASS2_AN6 = 23

} ADCHS_CHANNEL_5_INP_SEL;

typedef enum {

    ADCHS_CHANNEL_UNSYNC_TRIGGER_UNSYNC_SAMPLING = 0,
    ADCHS_CHANNEL_SYNC_SAMPLING = 1,
    ADCHS_CHANNEL_SYNC_TRIGGER_UNSYNC_SAMPLING = 2

} ADCHS_CHANNEL_TRIGGER_SAMPLING_SEL;

typedef enum {

    ADCHS_INPUT_MODE_SINGLE_ENDED_UNIPOLAR = 0,
    ADCHS_INPUT_MODE_SINGLE_ENDED_TWOS_COMP = 1,
    ADCHS_INPUT_MODE_DIFFERENTIAL_UNIPOLAR = 2,
    ADCHS_INPUT_MODE_DIFFERENTIAL_TWOS_COMP = 3

} ADCHS_INPUT_MODE;

typedef enum {

    ADCHS_DIGITAL_COMPARATOR_1 = 0,
    ADCHS_DIGITAL_COMPARATOR_2 = 1,
    ADCHS_DIGITAL_COMPARATOR_3 = 2,
    ADCHS_DIGITAL_COMPARATOR_4 = 3

} ADCHS_DIGITAL_COMPARATOR_ID;

typedef enum {

    ADCHS_DIGITAL_FILTER_1 = 0,
    ADCHS_DIGITAL_FILTER_2 = 1,
    ADCHS_DIGITAL_FILTER_3 = 2,
    ADCHS_DIGITAL_FILTER_4 = 3,
    ADCHS_DIGITAL_FILTER_5 = 4,
    ADCHS_DIGITAL_FILTER_6 = 5

} ADCHS_DIGITAL_FILTER_ID;

typedef enum {

    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_2X = 4,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_4X = 0,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_8X = 5,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_16X = 1,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_32X = 6,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_64X = 2,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_128X = 7,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_256X = 3

} ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO;

typedef enum {

    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_2 = 0,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_4 = 1,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_8 = 2,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_16 = 3,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_32 = 4,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_64 = 5,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_128 = 6,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_256 = 7

} ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT;

typedef enum {

    ADCHS_DIGITAL_FILTER_SIGNIFICANT_FIRST_12BITS = 0,
    ADCHS_DIGITAL_FILTER_SIGNIFICANT_ALL_16BITS = 1

} ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS;

typedef enum {

    ADCHS_SCAN_TRIGGER_SENSITIVE_EDGE = 0,
    ADCHS_SCAN_TRIGGER_SENSITIVE_LEVEL = 1

} ADCHS_SCAN_TRIGGER_SENSITIVE;

typedef enum {

    ADCHS_WARMUP_CLOCK_16 = 0,
    ADCHS_WARMUP_CLOCK_32 = 5,
    ADCHS_WARMUP_CLOCK_64 = 6,
    ADCHS_WARMUP_CLOCK_128 = 7,
    ADCHS_WARMUP_CLOCK_256 = 8,
    ADCHS_WARMUP_CLOCK_512 = 9,
    ADCHS_WARMUP_CLOCK_1024 = 10,
    ADCHS_WARMUP_CLOCK_2048 = 11,
    ADCHS_WARMUP_CLOCK_4096 = 12,
    ADCHS_WARMUP_CLOCK_8192 = 13,
    ADCHS_WARMUP_CLOCK_16384 = 14,
    ADCHS_WARMUP_CLOCK_32768 = 15

} ADCHS_WARMUP_CLOCK;

typedef enum {

    ADCHS_TRIGGER_SOURCE_NONE = 0,
    ADCHS_TRIGGER_SOURCE_GLOBAL_SOFTWARE_EDGE = 1,
    ADCHS_TRIGGER_SOURCE_SOFTWARE_LEVEL = 2,
    ADCHS_TRIGGER_SOURCE_SCAN = 3,
    ADCHS_TRIGGER_SOURCE_INT0 = 4,
    ADCHS_TRIGGER_SOURCE_TMR1_MATCH = 5,
    ADCHS_TRIGGER_SOURCE_TMR3_MATCH = 6,
    ADCHS_TRIGGER_SOURCE_TMR5_MATCH = 7,
    ADCHS_TRIGGER_SOURCE_OC1 = 16,
    ADCHS_TRIGGER_SOURCE_OC2 = 17,
    ADCHS_TRIGGER_SOURCE_OC3 = 18,
    ADCHS_TRIGGER_SOURCE_OC4 = 19,
    ADCHS_TRIGGER_SOURCE_CTMU = 20

} ADCHS_TRIGGER_SOURCE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/adchs_Registers_pic32mk.h"
#include "../templates/adchs_EnableControl_Default.h"
#include "../templates/adchs_TurboMode_Default.h"
#include "../templates/adchs_DigitalComparator_pic32mk.h"
#include "../templates/adchs_DigitalFilter_pic32mk.h"
#include "../templates/adchs_FIFO_Unsupported.h"
#include "../templates/adchs_DMA_Default.h"
#include "../templates/adchs_CVD_Default.h"
#include "../templates/adchs_VREFControl_Default.h"
#include "../templates/adchs_AnalogInputScan_Default.h"
#include "../templates/adchs_AnalogFeatureControl_Default.h"
#include "../templates/adchs_DigitalFeatureControl_pic32mk.h"
#include "../templates/adchs_AnalogInputModeControl_Default.h"
#include "../templates/adchs_TriggerControl_Default.h"
#include "../templates/adchs_ChannelTriggerSampleControl_Default.h"
#include "../templates/adchs_EarlyInterruptControl_Default.h"
#include "../templates/adchs_ManualControl_Default.h"
#include "../templates/adchs_UpdateReadyControl_Default.h"
#include "../templates/adchs_InputControl_Default.h"
#include "../templates/adchs_ExternalConversionRequest_Unsupported.h"
#include "../templates/adchs_Setup_pic32mk.h"
#include "../templates/adchs_AnalogInputCheck_Default.h"
#include "../templates/adchs_ChannelConfiguration_Default.h"
#include "../templates/adchs_ConversionResult_Default.h"
#include "../templates/adchs_ScanEnable_Unsupported.h"

