nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mk0512gpe100.h
/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API bool PLIB_ADCHS_ExistsRegisters(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsRegisters_pic32mk(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Enable(ADCHS_MODULE_ID index)
{
     ADCHS_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Disable(ADCHS_MODULE_ID index)
{
     ADCHS_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsEnableControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsEnableControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TurboModeEnable(ADCHS_MODULE_ID index)
{
     ADCHS_TurboModeEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TurboModeDisable(ADCHS_MODULE_ID index)
{
     ADCHS_TurboModeDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_TurboModeErrorHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_TurboModeErrorHasOccurred_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_TurboModeChannelSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID masterChannelID, ADCHS_CHANNEL_ID slaveChannelID)
{
     return ADCHS_TurboModeChannelSelect_Default(index, masterChannelID, slaveChannelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsTurboMode(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsTurboMode_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorAnalogInputSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_DigitalComparatorAnalogInputSelect_pic32mk(index, digComparator, analogInput);
}

PLIB_INLINE_API ADCHS_AN_INPUT_ID PLIB_ADCHS_DigitalComparatorAnalogInputGet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     return ADCHS_DigitalComparatorAnalogInputGet_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorEnable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorDisable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorInterruptEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorInterruptEnable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorInterruptDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorInterruptDisable_pic32mk(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id, bool intEnable, bool inBetweenOrEqual, bool greaterEqualHi, bool lessThanHi, bool greaterEqualLo, bool lessThanLo, ADCHS_AN_INPUT_ID analogInput, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_DigitalComparatorSetup_pic32mk(index, id, intEnable, inBetweenOrEqual, greaterEqualHi, lessThanHi, greaterEqualLo, lessThanLo, analogInput, hiLimit, loLimit);
}

PLIB_INLINE_API bool PLIB_ADCHS_DigitalComparatorEventHasOccurred(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id)
{
     return ADCHS_DigitalComparatorEventHasOccurred_pic32mk(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorLimitSet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID id, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_DigitalComparatorLimitSet_pic32mk(index, id, hiLimit, loLimit);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDigitalComparator(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDigitalComparator_pic32mk(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     ADCHS_DigitalFilterEnable_pic32mk(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     ADCHS_DigitalFilterDisable_pic32mk(index, id);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterOversamplingModeSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_AN_INPUT_ID analogInput, ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS length, ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO ratio, bool intEnable)
{
     ADCHS_DigitalFilterOversamplingModeSetup_pic32mk(index, id, analogInput, length, ratio, intEnable);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterAveragingModeSetup(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_AN_INPUT_ID analogInput, ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS length, ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT count, bool intEnable)
{
     ADCHS_DigitalFilterAveragingModeSetup_pic32mk(index, id, analogInput, length, count, intEnable);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterOversamplingModeRatioSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO ratio)
{
     ADCHS_DigitalFilterOversamplingModeRatioSelect_pic32mk(index, id, ratio);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterAveragingModeSampleCountSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id, ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT count)
{
     ADCHS_DigitalFilterAveragingModeSampleCountSelect_pic32mk(index, id, count);
}

PLIB_INLINE_API bool PLIB_ADCHS_DigitalFilterDataIsReady(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID id)
{
     return ADCHS_DigitalFilterDataIsReady_pic32mk(index, id);
}

PLIB_INLINE_API int16_t PLIB_ADCHS_DigitalFilterDataGet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID dfltrID)
{
     return ADCHS_DigitalFilterDataGet_pic32mk(index, dfltrID);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDataReadyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID digFilter)
{
     ADCHS_DigitalFilterDataReadyInterruptEnable_pic32mk(index, digFilter);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalFilterDataReadyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_FILTER_ID digFilter)
{
     ADCHS_DigitalFilterDataReadyInterruptDisable_pic32mk(index, digFilter);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDigitalFilter(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDigitalFilter_pic32mk(index);
}

PLIB_INLINE_API int32_t _PLIB_UNSUPPORTED PLIB_ADCHS_FIFORead(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFORead_Unsupported(index);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODataIsAvailable(ADCHS_MODULE_ID index)
{
     return ADCHS_FIFODataIsAvailable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_ADCHS_FIFODataReadyInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_FIFODataReadyInterruptEnable_Unsupported(index);
}

